# https://github.com/Homebrew/homebrew-bundle#usage

# AWS CLI
brew "awscli"
# A cat(1) clone with syntax highlighting and Git integration.
brew "bat"
# Need to run `brew link coreutils`
brew "coreutils"
# Code line counter
brew "cloc"
brew "ctop"
# DNS client
brew "dog"
brew "direnv"
# Faster 'find'
brew "fd"
# Audio/Video CLI editor
brew "ffmpeg"
# Fuzzy finder
brew "fzf"
# GitHub CLI
brew "gh"
brew "git"
brew "git-lfs"
# Curses-based system monitoring tool
brew "glances"
# GNU time utility (installs as 'gtime')
brew "gnu-time"
brew "howdoi"
# Newer top
brew "htop"
# HTTP client
brew "httpie"
# JSON processor
# https://stedolan.github.io/jq/
brew "jq"
# Another JSON processor
# https://github.com/jmespath/jp
brew "jmespath/jmespath/jp"
# Kubernetes high-level CLI
brew "k9s"
# Kubernetes low-level CLI 
brew "kubectl"
# Kubernetes management tool
brew "kustomize"
# ncurses-based log file viewer
brew "lnav"
# Mac App Store CLI
brew "mas"
brew "neovim"
brew "npm"
# Rust Language Support
# Required by some nvim plugins for language support on ARM64
brew "rust"
# Kubernetes logging tool
brew "stern"
# Manage symlinks
brew "stow"
# Faster grep
brew "the_silver_searcher"
# Simplified man pages with examples
brew "tldr"
# Terminal Multiplexer (a better Screen :) )
brew "tmux"
# List directory contents in a tree format
brew "tree"
# Ctags
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
# HTTP client
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# ZSH Completions
brew "zsh-completions"

# Command tab assistant
cask "alfred"
# A non-shitty windows switcher
cask "alt-tab"
# TODO: Uncomment when supports M1
# cask "amazon-music"
# API documentation browser
cask "dash"
# Help for managing multiple time zones
cask "clocker"
# SQL thick client
cask "dbeaver-community"
# Copy buffer manager
cask "copyq"
cask "docker"
cask "evernote"
cask "firefox"
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Mac screen sleep manager
cask "keepingyouawake"
# Knowledge base on top of a local folder of plain text Markdown files
cask "obsidian"
cask "slack"
# Mac GUI for Neovim
cask "vimr"
# Good editor. Ok IDE.
cask "visual-studio-code"
