# https://github.com/Homebrew/homebrew-bundle#usage

# A cat(1) clone with syntax highlighting and Git integration.
brew "bat"
# Help for managing multiple time zones
brew "clocker"
# Need to run `brew link coreutils`
brew "coreutils"
# DNS client
brew "dog"
brew "direnv"
# Faster 'find'
brew "fd"
# Fuzzy finder
brew "fzf"
# GitHub CLI
brew "gh"
brew "git"
# Curses-based system monitoring tool
brew "glances"
# GNU time utility (installs as 'gtime')
brew "gnu-time"
# HTTP client
brew "httpie"
# JSON processor
brew "jq"
# ncurses-based log file viewer
brew "lnav"
brew "neovim"
brew "stow"
brew "the_silver_searcher"
# Simplified man pages
brew "tldr"
brew "tmux"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
# HTTP client
brew "wget"

# A non-shitty windows switcher
cask "alt-tab"
# SQL thick client
cask "dbeaver"
# Copy buffer manager
cask "copyq"
# Mac screen sleep manager
cask "keepingyouawake"
# System monitor (including fans)
cask "stats"
# Alternative to Rubymine (my first ❤️  )
cask "visual-studio-code"
